const PHOTOS_COUNT = 25;
const MIN_LIKES_COUNT = 15;
const MAX_LIKES_COUNT = 200;
const MIN_COMMENTS = 0;
const MAX_COMMENTS = 30;
const MIN_AVATAR_ID = 1;
const MAX_AVATAR_ID = 6;
const MAX_MESSAGE_SENTENCES = 2;

const PHOTO_DESCRIPTIONS = [
  'Прекрасный закат на берегу моря',
  'Городские огни ночью - красота',
  'Свежий кофе и хорошая книга',
  'Полевые цветы на лугу',
  'Чашечка чая в уютной кофейне',
  'Осенняя атмосфера парка',
  'Ночное звёздное небо',
  'Уличные музыканты',
  'Океанские волны в лучах рассвета',
  'Старинный замок',
  'Велопрогулка по парку',
  'Заснеженные горные вершины',
  'Снежный барс в снегу',
  'Праздничный салют',
  'Аквариум с рыбками',
  'Круизный лайнер в порту',
  'Пряничный домик',
  'Летняя вечеринка на пляже',
  'Милаш-котенок',
  'Цветущая сакура',
  'Букет полевых цветов',
  'Тропический остров',
  'Новогодняя ёлка',
  'Зимний Байкал',
  'Ужин при свечах'
];

const COMMENT_MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

const COMMENT_AUTHOR_NAMES = [
  'Артём',
  'Дмитрий',
  'Анастасия',
  'Александр',
  'Пётр',
  'Николай',
  'Владислав',
  'Илона',
  'Аделия',
  'Григорий',
  'Анна'
];


export {
  PHOTOS_COUNT,
  MIN_LIKES_COUNT,
  MAX_LIKES_COUNT,
  MIN_COMMENTS,
  MAX_COMMENTS,
  MIN_AVATAR_ID,
  MAX_AVATAR_ID,
  MAX_MESSAGE_SENTENCES,
  PHOTO_DESCRIPTIONS,
  COMMENT_MESSAGES,
  COMMENT_AUTHOR_NAMES
};
